src/cf/Enums/инт_ТипыПодписчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>инт_ТипыПодписчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>RabbitMQ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодсистемаИнтеграции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйHTTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JRPC2</Name>
					<Comment>Тип подписчика JSON-RPC 2.0</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Kafka</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/инт_СтатусыРассылкиИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>инт_СтатусыРассылкиИсходящихСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сформирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПроцессеОтправки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/инт_ОтправкаИсходящихСообщений/Ext/Module.bsl
// BSLLS:NestedFunctionInParameters-off
// BSLLS:Typo-off
////////////////////////////////////////////////////////////////////////////////
// Модуль: инт_ОтправкаИсходящихСообщений
//
// Описание:
//  Модуль управления процессом отправки исходящих сообщений в рамках подсистемы интеграции.
//  Реализует многопоточную обработку сообщений с разделением по типам подписчиков.
//  
// Основные возможности:
//  - Запуск менеджера потоков рассылки сообщений
//  - Создание и управление фоновыми заданиями для отправки сообщений
//  - Разделение потоков по типам подписчиков (HTTP, RabbitMQ, JRPC и др.)
//  - Обработка сообщений пачками для оптимизации производительности
//  - Автоматическая очистка неактуальных потоков (сборка мусора)
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Запустить менеджер потоков рассылки сообщений
//
// Описание:
//  Запускает менеджер потоков для рассылки исходящих сообщений подписчикам.
//  Выполняет предварительную очистку завершенных потоков (сборка мусора),
//  затем создает новые потоки обработки в зависимости от настроек разделения по типам подписчиков.
//  
//  Если включено разделение потоков по типам подписчиков, создаются отдельные потоки для каждого типа
//  (HTTP, RabbitMQ, JRPC, Подсистема интеграции и др.). В противном случае создается единый поток
//  для всех типов подписчиков.
//
//  Вызывается регламентным заданием для периодической отправки накопленных сообщений.
//
Процедура инт_ЗапуститьМенеджерПотоковРассылкиСообщений() Экспорт
    РегистрыСведений.инт_МенеджерПотоковОтправкиСообщений.СобратьМусор();
    
    РазделятьПотокиПоТипам = инт_ОтправкаИсходящихСообщенийПовтИсп.РазделятьПотокиОтправкиПоТипамПодписчиков();
    
    Если РазделятьПотокиПоТипам Тогда
        Для Каждого ТипПодписчика Из Перечисления.инт_ТипыПодписчиков Цикл
            СоздатьПотокиОтправкиСообщенийПоТипу(ТипПодписчика);
        КонецЦикла;
    Иначе
        СоздатьПотокиОтправкиСообщенийПоТипу(Перечисления.инт_ТипыПодписчиков.ПустаяСсылка());
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Создать потоки отправки сообщений по типу подписчика
//
// Параметры:
//  ТипПодписчика - ПеречислениеСсылка.инт_ТипыПодписчиков - Тип подписчика для фильтрации сообщений.
//                  Если передана пустая ссылка, обрабатываются сообщения для всех типов подписчиков.
//
// Описание:
//  Создает необходимое количество потоков отправки сообщений для указанного типа подписчика.
//  Количество потоков определяется менеджером потоков на основе текущей нагрузки и настроек.
//
Процедура СоздатьПотокиОтправкиСообщенийПоТипу(ТипПодписчика)
    КоличествоПотоковКСозданию = РегистрыСведений
                                    .инт_МенеджерПотоковОтправкиСообщений
                                    .КоличествоПотоковКСозданию(ТипПодписчика);
    Для Итератор = 1 По КоличествоПотоковКСозданию Цикл // BSLLS:UnusedLocalVariable-off
        СоздатьПотокОтправкиСообщений(ТипПодписчика);
    КонецЦикла;
    
КонецПроцедуры

// Процедура - Создать поток отправки сообщений
//
// Параметры:
//  ТипПодписчика - ПеречислениеСсылка.инт_ТипыПодписчиков - Тип подписчика для фильтрации сообщений.
//
// Описание:
//  Создает один фоновый поток для обработки и отправки сообщений указанного типа подписчика.
//  
//  Процесс выполнения:
//  1. Получает пачку сообщений из очереди (размер пачки настраивается)
//  2. Если сообщений нет - завершает работу
//  3. Изменяет статус сообщений на "В процессе отправки"
//  4. Запускает фоновое задание для обработки пачки сообщений
//  5. Регистрирует созданный поток в менеджере потоков
//  
//  При возникновении ошибки откатывает транзакцию и записывает информацию в журнал регистрации.
//
Процедура СоздатьПотокОтправкиСообщений(ТипПодписчика)
    КоличествоСообщенийВПачке = инт_ОтправкаИсходящихСообщенийПовтИсп.РазмерПачкиОтправкиСообщений();
    МассивСообщений = РегистрыСведений
                            .инт_ТекущийСтатусРассылкиСообщений
                            .ПолучитьСообщенияКОтправке(КоличествоСообщенийВПачке, ТипПодписчика);
    Если МассивСообщений.Количество() = 0 Тогда
        // Нет сообщений для обработки.
        Возврат;
    КонецЕсли;
    
    НачатьТранзакцию();
    Попытка
        РегистрыСведений.инт_ТекущийСтатусРассылкиСообщений
                                        .ЗаписатьСтатусСообщений(МассивСообщений,
                                            Перечисления.инт_СтатусыРассылкиИсходящихСообщений.ВПроцессеОтправки);
        МассивПараметров = Новый Массив;
        МассивПараметров.Добавить(МассивСообщений);
        Поток = ФоновыеЗадания.Выполнить("инт_ОтправкаИсходящихСообщенийСлужебный.ВыполнитьОбработкуСообщенийВПотоке",
                                                МассивПараметров,
                                                ,
                                                СтрШаблон("Поток отправки исходящих сообщений по Типу подписчика <%1>.",
                                                    ТипПодписчика));
        РегистрыСведений.инт_МенеджерПотоковОтправкиСообщений
                            .ЗарегистрироватьПоток(Поток.УникальныйИдентификатор, ТипПодписчика, МассивСообщений);
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        СообщениеОбОшибке = СтрШаблон("Ошибка при создании потока отправки сообщений по типу подписчика <%1>.
        |
        |Информация об ошибке: %2", ТипПодписчика, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
        ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.МенеджерПотоковОтправкиСообщений",
                                        УровеньЖурналаРегистрации.Ошибка, , , СообщениеОбОшибке);
    КонецПопытки;
    
КонецПроцедуры

#КонецОбласти
